In [2]:
import pandas as pd
import numpy as np
import os

In [3]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [4]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [5]:
index=np.arange(1,df.From_To.count()+1)
index
df.set_index(index,inplace=True)
df

            From_To  FlightNumber  RecentDelays              Airline
1      LoNDon_paris       10045.0      [23, 47]               KLM(!)
2      MAdrid_miLAN           NaN            []    <Air France> (12)
3  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
4    Budapest_PaRis           NaN          [13]       12. Air France
5   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [6]:
# 1. Some values in the the FlightNumber column are missing. These numbers are
# meant to increase by 10 with each row so 10055 and 10075 need to be put in
# place. Fill in these missing numbers and make the column an integer column
# (instead of a float column).

In [7]:
df["FlightNumber"]

1    10045.0
2        NaN
3    10065.0
4        NaN
5    10085.0
Name: FlightNumber, dtype: float64

In [8]:
for i in np.arange(1,df.From_To.count()+1):
    if pd.isnull(df.FlightNumber.loc[i,]):
        df.loc[i,'FlightNumber']=df.FlightNumber.loc[i-1,] + 10
df['FlightNumber']
df

            From_To  FlightNumber  RecentDelays              Airline
1      LoNDon_paris       10045.0      [23, 47]               KLM(!)
2      MAdrid_miLAN       10055.0            []    <Air France> (12)
3  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
4    Budapest_PaRis       10075.0          [13]       12. Air France
5   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [9]:
df['FlightNumber']=pd.to_numeric(df['FlightNumber']).astype(int)

In [10]:
df

            From_To  FlightNumber  RecentDelays              Airline
1      LoNDon_paris         10045      [23, 47]               KLM(!)
2      MAdrid_miLAN         10055            []    <Air France> (12)
3  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
4    Budapest_PaRis         10075          [13]       12. Air France
5   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [11]:
df.dtypes

From_To         object
FlightNumber     int32
RecentDelays    object
Airline         object
dtype: object

In [12]:
# 2. The From_To column would be better as two separate columns! Split each
# string on the underscore delimiter _ to give a new temporary DataFrame with
# the correct values. Assign the correct column names to this temporary
# DataFrame.

In [13]:
temporarydf=df.copy()
temporarydf

            From_To  FlightNumber  RecentDelays              Airline
1      LoNDon_paris         10045      [23, 47]               KLM(!)
2      MAdrid_miLAN         10055            []    <Air France> (12)
3  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
4    Budapest_PaRis         10075          [13]       12. Air France
5   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [14]:
temporarydf['From_To']

1        LoNDon_paris
2        MAdrid_miLAN
3    londON_StockhOlm
4      Budapest_PaRis
5     Brussels_londOn
Name: From_To, dtype: object

In [15]:
temporarydf['From'],temporarydf['To']=zip(*temporarydf["From_To"].apply(lambda x:x.split("_",1)))

In [16]:
temporarydf

,From_To,FlightNumber,RecentDelays,Airline,From,To
1,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
2,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
3,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
4,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
5,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

In [17]:
# 3. Notice how the capitalisation of the city names is all mixed up in this
# temporary DataFrame. Standardise the strings so that only the first letter is
# uppercase (e.g. "londON" should become "London".)

In [18]:
temporarydf.From=temporarydf.From.str.capitalize()
temporarydf.From

1      London
2      Madrid
3      London
4    Budapest
5    Brussels
Name: From, dtype: object

In [19]:
temporarydf.To=temporarydf.To.str.capitalize()
temporarydf.To

1        Paris
2        Milan
3    Stockholm
4        Paris
5       London
Name: To, dtype: object

In [20]:
temporarydf

,From_To,FlightNumber,RecentDelays,Airline,From,To
1,LoNDon_paris,10045,"[23, 47]",KLM(!),London,Paris
2,MAdrid_miLAN,10055,[],<Air France> (12),Madrid,Milan
3,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm
4,Budapest_PaRis,10075,[13],12. Air France,Budapest,Paris
5,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,London

In [21]:
# 4. Delete the From_To column from df and attach the temporary DataFrame
# from the previous questions.

In [22]:
df.drop('From_To',axis=1,inplace=True)
df

   FlightNumber  RecentDelays              Airline
1         10045      [23, 47]               KLM(!)
2         10055            []    <Air France> (12)
3         10065  [24, 43, 87]  (British Airways. )
4         10075          [13]       12. Air France
5         10085      [67, 32]          "Swiss Air"

In [23]:
df['From_To']=temporarydf['From_To']
df

   FlightNumber  RecentDelays              Airline           From_To
1         10045      [23, 47]               KLM(!)      LoNDon_paris
2         10055            []    <Air France> (12)      MAdrid_miLAN
3         10065  [24, 43, 87]  (British Airways. )  londON_StockhOlm
4         10075          [13]       12. Air France    Budapest_PaRis
5         10085      [67, 32]          "Swiss Air"   Brussels_londOn

In [24]:
# 5. In the RecentDelays column, the values have been entered into the
# DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value
# should be NaN.
# Expand the Series of lists into a DataFrame named delays, rename the columns
# delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
# with delays.

In [25]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [30]:
rows = []
_ = df.apply(lambda row:[rows.append([row['From_To'], row['FlightNumber'],nn,row['Airline']])
 for nn in row.RecentDelays], axis=1)

In [31]:
rows

[['LoNDon_paris', 10045.0, 23, 'KLM(!)'],
 ['LoNDon_paris', 10045.0, 47, 'KLM(!)'],
 ['londON_StockhOlm', 10065.0, 24, '(British Airways. )'],
 ['londON_StockhOlm', 10065.0, 43, '(British Airways. )'],
 ['londON_StockhOlm', 10065.0, 87, '(British Airways. )'],
 ['Budapest_PaRis', nan, 13, '12. Air France'],
 ['Brussels_londOn', 10085.0, 67, '"Swiss Air"'],
 ['Brussels_londOn', 10085.0, 32, '"Swiss Air"']]

In [70]:
df_new = pd.DataFrame(rows, columns=df.columns)
#Printing existing dataframe (for comparison view)
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [71]:
df_new

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0            23               KLM(!)
1      LoNDon_paris       10045.0            47               KLM(!)
2  londON_StockhOlm       10065.0            24  (British Airways. )
3  londON_StockhOlm       10065.0            43  (British Airways. )
4  londON_StockhOlm       10065.0            87  (British Airways. )
5    Budapest_PaRis           NaN            13       12. Air France
6   Brussels_londOn       10085.0            67          "Swiss Air"
7   Brussels_londOn       10085.0            32          "Swiss Air"

In [72]:
df3 = pd.DataFrame(df['RecentDelays'].values.tolist())
df3

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [73]:
length_cols = df3.shape[1]
length_cols

3

In [74]:
df3.columns[0]

0

In [75]:
col_list = []
col_dict ={}
for i in range(length_cols):
    Key = df3.columns[i]
    #print(key,i)
    Value = "Delay" + str(i+1)
    col_dict[Key] = Value
col_dict

{0: 'Delay1', 1: 'Delay2', 2: 'Delay3'}

In [76]:
df3.rename(columns=col_dict,inplace=True)
df3

   Delay1  Delay2  Delay3
0    23.0    47.0     NaN
1     NaN     NaN     NaN
2    24.0    43.0    87.0
3    13.0     NaN     NaN
4    67.0    32.0     NaN

In [77]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [78]:
df[["Delay1","Delay2","Delay3"]] = df3[["Delay1","Delay2","Delay3"]]

In [79]:
df

,From_To,FlightNumber,RecentDelays,Airline,Delay1,Delay2,Delay3
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),23.0,47.0,NaN
1,MAdrid_miLAN,NaN,[],<Air France> (12),NaN,NaN,NaN
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),24.0,43.0,87.0
3,Budapest_PaRis,NaN,[13],12. Air France,13.0,NaN,NaN
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",67.0,32.0,NaN

In [80]:
df.drop('RecentDelays',axis=1,inplace=True)
df

            From_To  FlightNumber              Airline  Delay1  Delay2  Delay3
0      LoNDon_paris       10045.0               KLM(!)    23.0    47.0     NaN
1      MAdrid_miLAN           NaN    <Air France> (12)     NaN     NaN     NaN
2  londON_StockhOlm       10065.0  (British Airways. )    24.0    43.0    87.0
3    Budapest_PaRis           NaN       12. Air France    13.0     NaN     NaN
4   Brussels_londOn       10085.0          "Swiss Air"    67.0    32.0     NaN